In [2]:
import csv, sqlite3
con = sqlite3.connect("FinalDB.db")
cur = con.cursor()

In [3]:
%load_ext sql

In [4]:
%sql sqlite:///FinalDB.db

In [5]:
from prettytable import DEFAULT

/var/folders/f5/5zxptbrx2r14hz8gp7bjk0lc0000gn/T/ipykernel_73731/1109598261.py:1: DeprecationWarning: the 'DEFAULT' constant is deprecated, use the 'TableStyle' enum instead
  from prettytable import DEFAULT

In [6]:
import pandas as pd 

df1 = pd.read_csv("/Users/danielleshine/Documents/data_eng/datasets/ChicagoCrimeData.csv")
df1.to_sql("CHICAGO_CRIME_DATA", con, if_exists='replace', index=False, method="multi", chunksize=100)

df2 = pd.read_csv("/Users/danielleshine/Documents/data_eng/datasets/ChicagoCensusData.csv")
df2.to_sql("CENSUS_DATA", con, if_exists='replace', index=False, method="multi", chunksize=100)

df3 = pd.read_csv("/Users/danielleshine/Documents/data_eng/datasets/ChicagoPublicSchools.csv")
df3.to_sql("CHICAGO_PUBLIC_SCHOOLS", con, if_exists='replace', index=False, method="multi", chunksize=100)

566

In [7]:
# list of columns in SCHOOLS table and their column type (datatype)
%sql SELECT name, type, length(type) FROM PRAGMA_TABLE_INFO('CENSUS_DATA');

 * sqlite:///FinalDB.db
Done.

[('COMMUNITY_AREA_NUMBER', 'REAL', 4),
 ('COMMUNITY_AREA_NAME', 'TEXT', 4),
 ('PERCENT_OF_HOUSING_CROWDED', 'REAL', 4),
 ('PERCENT_HOUSEHOLDS_BELOW_POVERTY', 'REAL', 4),
 ('PERCENT_AGED_16__UNEMPLOYED', 'REAL', 4),
 ('PERCENT_AGED_25__WITHOUT_HIGH_SCHOOL_DIPLOMA', 'REAL', 4),
 ('PERCENT_AGED_UNDER_18_OR_OVER_64', 'REAL', 4),
 ('PER_CAPITA_INCOME', 'INTEGER', 7),
 ('HARDSHIP_INDEX', 'REAL', 4)]

In [8]:
# list of columns in SCHOOLS table and their column type (datatype)
%sql SELECT name, type, length(type) FROM PRAGMA_TABLE_INFO('CHICAGO_CRIME_DATA');

 * sqlite:///FinalDB.db
Done.

[('ID', 'INTEGER', 7),
 ('CASE_NUMBER', 'TEXT', 4),
 ('DATE', 'TEXT', 4),
 ('BLOCK', 'TEXT', 4),
 ('IUCR', 'TEXT', 4),
 ('PRIMARY_TYPE', 'TEXT', 4),
 ('DESCRIPTION', 'TEXT', 4),
 ('LOCATION_DESCRIPTION', 'TEXT', 4),
 ('ARREST', 'INTEGER', 7),
 ('DOMESTIC', 'INTEGER', 7),
 ('BEAT', 'INTEGER', 7),
 ('DISTRICT', 'INTEGER', 7),
 ('WARD', 'REAL', 4),
 ('COMMUNITY_AREA_NUMBER', 'REAL', 4),
 ('FBICODE', 'TEXT', 4),
 ('X_COORDINATE', 'REAL', 4),
 ('Y_COORDINATE', 'REAL', 4),
 ('YEAR', 'INTEGER', 7),
 ('LATITUDE', 'REAL', 4),
 ('LONGITUDE', 'REAL', 4),
 ('LOCATION', 'TEXT', 4)]

In [9]:
# Problem 1
# list of columns in SCHOOLS table and their column type (datatype)
%sql SELECT count(*) from CHICAGO_CRIME_DATA;

 * sqlite:///FinalDB.db
Done.

[(533,)]

In [10]:
# Problem 2
# List community area names and numbers with per capita income less than 11000.
%sql SELECT COMMUNITY_AREA_NAME, COMMUNITY_AREA_NUMBER, PER_CAPITA_INCOME FROM CENSUS_DATA WHERE PER_CAPITA_INCOME < 11000;

 * sqlite:///FinalDB.db
Done.

[('West Garfield Park', 26.0, 10934),
 ('South Lawndale', 30.0, 10402),
 ('Fuller Park', 37.0, 10432),
 ('Riverdale', 54.0, 8201)]

In [11]:
# Problem 3
# List all case numbers for crimes involving minors?(children are not considered minors for the purposes of crime analysis)

%sql select * from CHICAGO_CRIME_DATA limit 5;

 * sqlite:///FinalDB.db
Done.

[(3512276, 'HK587712', '2004-08-28', '047XX S KEDZIE AVE', '890', 'THEFT', 'FROM BUILDING', 'SMALL RETAIL STORE', 0, 0, 911, 9, 14.0, 58.0, '6', 1155838.0, 1873050.0, 2004, 41.8074405, -87.70395585, '(41.8074405, -87.703955849)'),
 (3406613, 'HK456306', '2004-06-26', '009XX N CENTRAL PARK AVE', '820', 'THEFT', '$500 AND UNDER', 'OTHER', 0, 0, 1112, 11, 27.0, 23.0, '6', 1152206.0, 1906127.0, 2004, 41.89827996, -87.71640551, '(41.898279962, -87.716405505)'),
 (8002131, 'HT233595', '2011-04-04', '043XX S WABASH AVE', '820', 'THEFT', '$500 AND UNDER', 'NURSING HOME/RETIREMENT HOME', 0, 0, 221, 2, 3.0, 38.0, '6', 1177436.0, 1876313.0, 2011, 41.81593313, -87.62464213, '(41.815933131, -87.624642127)'),
 (7903289, 'HT133522', '2010-12-30', '083XX S KINGSTON AVE', '840', 'THEFT', 'FINANCIAL ID THEFT: OVER $300', 'RESIDENCE', 0, 0, 423, 4, 7.0, 46.0, '6', 1194622.0, 1850125.0, 2010, 41.74366532, -87.56246276, '(41.743665322, -87.562462756)'),
 (10402076, 'HZ138551', '2016-02-02', '033XX W 66TH ST', '820', 'THEFT', '$500 AND UNDER', 'ALLEY', 0, 0, 831, 8, 15.0, 66.0, '6', 1155240.0, 1860661.0, 2016, 41.7734553, -87.70648047, '(41.773455295, -87.706480471)')]

In [12]:
%sql select count(ID) AS TOTAL, BLOCK from CHICAGO_CRIME_DATA group by COMMUNITY_AREA_NUMBER order by total desc limit 5;

 * sqlite:///FinalDB.db
Done.

[(43, '055XX W GLADYS AVE'),
 (43, '045XX S DAMEN AV'),
 (22, '009XX N CENTRAL PARK AVE'),
 (21, '060XX S HALSTED ST'),
 (16, '019XX S MILLARD AVE')]

In [13]:
%sql select COUNT(*) AS TOTAL, COMMUNITY_AREA_NUMBER \
    from CHICAGO_CRIME_DATA \
    group by COMMUNITY_AREA_NUMBER ORDER BY TOTAL DESC LIMIT 5;

 * sqlite:///FinalDB.db
Done.

[(43, 25.0), (43, None), (22, 23.0), (21, 68.0), (16, 29.0)]

In [21]:
%sql SELECT NAME.COMMUNITY_AREA_NUMBER, NAME.COMMUNITY_AREA_NAME, COUNT(NUM.COMMUNITY_AREA_NUMBER) AS TOTAL \
FROM CHICAGO_CRIME_DATA AS NUM \
LEFT JOIN CENSUS_DATA AS NAME ON NUM.COMMUNITY_AREA_NUMBER = NAME.COMMUNITY_AREA_NUMBER \
GROUP BY NAME.COMMUNITY_AREA_NUMBER, NAME.COMMUNITY_AREA_NAME \
ORDER BY TOTAL DESC \
LIMIT 2;

 * sqlite:///FinalDB.db
Done.

[(25.0, 'Austin', 43), (23.0, 'Humboldt park', 22)]

In [15]:
%sql select * from CENSUS_DATA LIMIT 10;

 * sqlite:///FinalDB.db
Done.

[(1.0, 'Rogers Park', 7.7, 23.6, 8.7, 18.2, 27.5, 23939, 39.0),
 (2.0, 'West Ridge', 7.8, 17.2, 8.8, 20.8, 38.5, 23040, 46.0),
 (3.0, 'Uptown', 3.8, 24.0, 8.9, 11.8, 22.2, 35787, 20.0),
 (4.0, 'Lincoln Square', 3.4, 10.9, 8.2, 13.4, 25.5, 37524, 17.0),
 (5.0, 'North Center', 0.3, 7.5, 5.2, 4.5, 26.2, 57123, 6.0),
 (6.0, 'Lake View', 1.1, 11.4, 4.7, 2.6, 17.0, 60058, 5.0),
 (7.0, 'Lincoln Park', 0.8, 12.3, 5.1, 3.6, 21.5, 71551, 2.0),
 (8.0, 'Near North Side', 1.9, 12.9, 7.0, 2.5, 22.6, 88669, 1.0),
 (9.0, 'Edison Park', 1.1, 3.3, 6.5, 7.4, 35.3, 40959, 8.0),
 (10.0, 'Norwood Park', 2.0, 5.4, 9.0, 11.5, 39.5, 32875, 21.0)]

In [16]:
%sql SELECT COUNT(*) \
FROM CHICAGO_CRIME_DATA \
WHERE DESCRIPTION LIKE '%minor%';

 * sqlite:///FinalDB.db
Done.

[(2,)]

In [17]:
%sql select * from CHICAGO_CRIME_DATA where PRIMARY_TYPE = "KIDNAPPING" AND DESCRIPTION like '%child%';

 * sqlite:///FinalDB.db
Done.

[(5276766, 'HN144152', '2007-01-26', '050XX W VAN BUREN ST', '1792', 'KIDNAPPING', 'CHILD ABDUCTION/STRANGER', 'STREET', 0, 0, 1533, 15, 29.0, 25.0, '20', 1143050.0, 1897546.0, 2007, 41.87490841, -87.75024931, '(41.874908413, -87.750249307)')]

In [18]:
%sql select AVG(SAFETY_SCORE) from CHICAGO_PUBLIC_SCHOOLS WHERE "Elementary, Middle, or High School" = 'MS';

 * sqlite:///FinalDB.db
Done.

[(48.0,)]

In [19]:
%sql select "Elementary, Middle, or High School" from CHICAGO_PUBLIC_SCHOOLS limit 10;

 * sqlite:///FinalDB.db
Done.

[('ES',),
 ('ES',),
 ('ES',),
 ('ES',),
 ('HS',),
 ('MS',),
 ('HS',),
 ('ES',),
 ('HS',),
 ('ES',)]

In [23]:
%sql SELECT * FROM CHICAGO_CRIME_DATA LIMIT 1;

 * sqlite:///FinalDB.db
Done.

[(3512276, 'HK587712', '2004-08-28', '047XX S KEDZIE AVE', '890', 'THEFT', 'FROM BUILDING', 'SMALL RETAIL STORE', 0, 0, 911, 9, 14.0, 58.0, '6', 1155838.0, 1873050.0, 2004, 41.8074405, -87.70395585, '(41.8074405, -87.703955849)')]

In [25]:
%sql SELECT * FROM CENSUS_DATA LIMIT 1;

 * sqlite:///FinalDB.db
Done.

[(1.0, 'Rogers Park', 7.7, 23.6, 8.7, 18.2, 27.5, 23939, 39.0)]

In [31]:
%%sql SELECT C.CASE_NUMBER, C.PRIMARY_TYPE, C.COMMUNITY_AREA_NUMBER
FROM CHICAGO_CRIME_DATA C

JOIN CENSUS_DATA CD ON C.COMMUNITY_AREA_NUMBER = CD.COMMUNITY_AREA_NUMBER

WHERE C.LOCATION_DESCRIPTION LIKE '%SCHOOL%'

 * sqlite:///FinalDB.db
Done.

[('HL353697', 'BATTERY', 43.0),
 ('HL725506', 'BATTERY', 4.0),
 ('HP716225', 'BATTERY', 35.0),
 ('HH639427', 'BATTERY', 25.0),
 ('JA460432', 'BATTERY', 70.0),
 ('HS200939', 'CRIMINAL DAMAGE', 25.0),
 ('HK577020', 'NARCOTICS', 1.0),
 ('HS305355', 'NARCOTICS', 58.0),
 ('HT315369', 'ASSAULT', 27.0),
 ('HR585012', 'CRIMINAL TRESPASS', 70.0)]

In [32]:
%sql SELECT * FROM CHICAGO_SOCIOECONOMIC_DATA LIMIT 1;

 * sqlite:///FinalDB.db
(sqlite3.OperationalError) no such table: CHICAGO_SOCIOECONOMIC_DATA
[SQL: SELECT * FROM CHICAGO_SOCIOECONOMIC_DATA LIMIT 1;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)